Revit 2027 API
ScheduleDefinition.CanSortByField Method
 Checks whether a field can be used for sorting/grouping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanSortByField(
	ScheduleFieldId fieldId
)
Public Function CanSortByField (
	fieldId As ScheduleFieldId
) As Boolean
public:
bool CanSortByField(
	ScheduleFieldId^ fieldId
)
member CanSortByField :
        fieldId : ScheduleFieldId -> bool
Parameters
fieldId ScheduleFieldId
 The ID of the field to check.
Return Value
Boolean
 True if the field can be used for sorting/grouping, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  fieldId is not the ID of a field in this ScheduleDefinition.
ArgumentNullException |  A non-optional argument was null
Remarks
 Schedules cannot be sorted/grouped by the Count field, Percentage fields, or Formula fields that depend on Percentage fields because those types of fields don't have meaningful values until after sorting and grouping takes place.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace